# Parameter Type Id Bending Detail Type Angular Dimensions For Cranks Enabled Property

Source: https://www.revitapidocs.com/2026/dd7b3432-0cac-ea1b-61ee-8e30a02e6f44.htm

---

| Parameter Type Id Bending Detail Type Angular Dimensions For Cranks Enabled Property |
| --- |

"Crank Angles"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId BendingDetailTypeAngularDimensionsForCranksEnabled { get; }
```

```
Public Shared ReadOnly Property BendingDetailTypeAngularDimensionsForCranksEnabled As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ BendingDetailTypeAngularDimensionsForCranksEnabled {
	ForgeTypeId^ get ();
}
```

```
static member BendingDetailTypeAngularDimensionsForCranksEnabled : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace